---
kind: method
id: M:Autodesk.Revit.DB.FabricationServiceButton.IsValid
source: html/aba8c1e1-e011-c5f5-4d24-1a7e5c4b89bb.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.IsValid Method

Checks if the button contains only valid fittings.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the button contains only valid fittings.